#1.Роздрукувати всі парні числа менші 100 (написати два варіанти коду:
# один використовуючи цикл while, а інший з використанням циклу for).
j= 0
while j< 100:
    if j%2 ==0:
        print(j)
    j=j+1

for i in range(0,100,2):
    print(i)

# 2. Роздрукувати всі непарні числа менші 100. (написати два варіанти коду:
# один використовуючи оператор continue, а інший без цього оператора).

c= 0
while c< 100:
    if c%2 ==1:
        print(c)
    c=c+1

for i in range(100):
    if i %2 ==0:
        continue
    print(i)
# 3.  Перевірити чи список містить непарні числа.
#           (Підказка: використати оператор break)
for i in range(0,100):
    if i%2==1:
        print("парні числа")
        break


# 4.  Створити список, який містить елементи цілочисельного типу, потім за
# допомогою циклу перебору змінити тип даних елементів на числа з плаваючою
# крапкою. (Підказка: використати вбудовану функцію float ()).


a_lis=[1,40,23,2]
for i in a_lis:
    i=float(i)
    print(i)

# 5.  Вивести числа Фібоначі включно до введеного числа n, використовуючи
# цикли. (Послідовність чисел Фібоначі 0, 1, 1, 2, 3, 5, 8, 13 і т.д.)

n = int(input("enter n:"))

a = 0
b = 1
for i in range(0,n):
    fib =a+b
    print(fib)
    a=b
    b=fib



# 6.  Створити список, що складається з чотирьох елементів типу string. Потім,
# за допомогою циклу for, вивести елементи по черзі на екран.


ch = ["sdf","hg","asd","jhgfdgfd"]
k=0
for i in ch:
    print(i,k)
    k+=1

# 7.  Змінити попередню програму так, щоб в кінці кожної букви елементів при
# виводі додавався певний символ, наприклад “#”.
# (Підказка: цикл for може бути вкладений в інший цикл, а також  треба
# використати функцію print(“ ”, end=”%”)).

ch = ["aaaaaaaa","bbbbbb","ccccccc","dddddddd"]
for i in ch:
    for j in i:
        print(j+"#",end="")
    print()

# 8.  Юзер вводить число з клавіатури, написати скріпт, який визначає чи
# це число просте чи складне.

number = int(input("enter number"))
count = 0
for i in range(1,10):
    if number%i == 0:
        count += 1
if count >2:
     print("складене")
else:
     print("просте")



# 9.  Знайти максимальну цифру дійсного числа. Дійсне число
# генеруємо випадковим чином за допомогою методу random() з модуля random
# (для цього підключаємо модуль random наступним чином
# from random import random)

from random import random
number = round(random() * 100,4)
print(number)
number_str = str(number)
max = 0
for i in range(len(number_str)):
    if number_str[i] == '.':
        continue
    elif max < int(number_str[i]):
      max = int(number_str[i])
print(max)
# 10.  Визначити чи введене слово поліндром, тобто чи воно читається однаково
#  зліва направо і навпаки.

word = input("enter word")
word_pol= word[::-1]
if word==word_pol:
    print("Поліндром")
else:
    print("не поліндром")